Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.73/Microchip.PIC32CX-BZ_DFP.pdsc
      <condition id="C Lib">
         <accept Tcompiler="ARMCC" Toutput="lib"/>
         <accept Tcompiler="GCC" Toutput="lib"/>
         <accept Tcompiler="IAR" Toutput="lib"/>
      </condition>
      <condition id="PIC32CX1012BZ25032">
         <require Dvendor="Microchip:3" Dname="PIC32CX1012BZ25032"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CX1012BZ24032">
         <require Dvendor="Microchip:3" Dname="PIC32CX1012BZ24032"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="WBZ450">
         <require Dvendor="Microchip:3" Dname="WBZ450"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="WBZ451">
         <require Dvendor="Microchip:3" Dname="WBZ451"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CX1012BZ25048">
         <require Dvendor="Microchip:3" Dname="PIC32CX1012BZ25048"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="PIC32CX1012BZ25032">
         <description>Headers and startup code for Microchip PIC32CX1012BZ25032</description>
         <files>
            <file condition="C" category="include" name="BZ25/include/"/>
            <file condition="C" category="header" name="BZ25/include/pic32c.h"/>
            <file condition="C Exe" category="source" name="BZ25/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="BZ25/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="BZ25/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="BZ25/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="BZ25/gcc/gcc/startup_pic32cx1012bz25032.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="BZ25/gcc/system_pic32cx1012bz25032.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="BZ25/gcc/gcc/pic32cx1012bz25032_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="BZ25/gcc/gcc/pic32cx1012bz25032_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="BZ25/armcc/armcc/startup_pic32cx1012bz25032.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="BZ25/armcc/system_pic32cx1012bz25032.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="BZ25/iar/iar/startup_pic32cx1012bz25032.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="BZ25/iar/system_pic32cx1012bz25032.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="BZ25/iar/config/linker/Microchip/pic32cx1012bz25032/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="BZ25/iar/config/linker/Microchip/pic32cx1012bz25032/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="PIC32CX1012BZ24032">
         <description>Headers and startup code for Microchip PIC32CX1012BZ24032</description>
         <files>
            <file condition="C" category="include" name="BZ24/include/"/>
            <file condition="C" category="header" name="BZ24/include/pic32c.h"/>
            <file condition="C Exe" category="source" name="BZ24/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="BZ24/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="BZ24/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="BZ24/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="BZ24/gcc/gcc/startup_pic32cx1012bz24032.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="BZ24/gcc/system_pic32cx1012bz24032.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="BZ24/gcc/gcc/pic32cx1012bz24032_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="BZ24/gcc/gcc/pic32cx1012bz24032_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="BZ24/armcc/armcc/startup_pic32cx1012bz24032.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="BZ24/armcc/system_pic32cx1012bz24032.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="BZ24/iar/iar/startup_pic32cx1012bz24032.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="BZ24/iar/system_pic32cx1012bz24032.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="BZ24/iar/config/linker/Microchip/pic32cx1012bz24032/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="BZ24/iar/config/linker/Microchip/pic32cx1012bz24032/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="WBZ450">
         <description>Headers and startup code for Microchip WBZ450</description>
         <files>
            <file condition="C" category="include" name="WBZ450/include/"/>
            <file condition="C" category="header" name="WBZ450/include/sam.h"/>
            <file condition="C Exe" category="source" name="WBZ450/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="WBZ450/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="WBZ450/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="WBZ450/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="WBZ450/gcc/gcc/startup_wbz450.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="WBZ450/gcc/system_wbz450.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="WBZ450/gcc/gcc/wbz450_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="WBZ450/gcc/gcc/wbz450_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="WBZ450/armcc/armcc/startup_wbz450.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="WBZ450/armcc/system_wbz450.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="WBZ450/iar/iar/startup_wbz450.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="WBZ450/iar/system_wbz450.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="WBZ450/iar/config/linker/Microchip/wbz450/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="WBZ450/iar/config/linker/Microchip/wbz450/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="WBZ451">
         <description>Headers and startup code for Microchip WBZ451</description>
         <files>
            <file condition="C" category="include" name="WBZ451/include/"/>
            <file condition="C" category="header" name="WBZ451/include/sam.h"/>
            <file condition="C Exe" category="source" name="WBZ451/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="WBZ451/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="WBZ451/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="WBZ451/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="WBZ451/gcc/gcc/startup_wbz451.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="WBZ451/gcc/system_wbz451.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="WBZ451/gcc/gcc/wbz451_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="WBZ451/gcc/gcc/wbz451_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="WBZ451/armcc/armcc/startup_wbz451.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="WBZ451/armcc/system_wbz451.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="WBZ451/iar/iar/startup_wbz451.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="WBZ451/iar/system_wbz451.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="WBZ451/iar/config/linker/Microchip/wbz451/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="WBZ451/iar/config/linker/Microchip/wbz451/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="PIC32CX1012BZ25048">
         <description>Headers and startup code for Microchip PIC32CX1012BZ25048</description>
         <files>
            <file condition="C" category="include" name="BZ25/include/"/>
            <file condition="C" category="header" name="BZ25/include/pic32c.h"/>
            <file condition="C Exe" category="source" name="BZ25/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="BZ25/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="BZ25/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="BZ25/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="BZ25/gcc/gcc/startup_pic32cx1012bz25048.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="BZ25/gcc/system_pic32cx1012bz25048.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="BZ25/gcc/gcc/pic32cx1012bz25048_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="BZ25/gcc/gcc/pic32cx1012bz25048_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="BZ25/armcc/armcc/startup_pic32cx1012bz25048.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="BZ25/armcc/system_pic32cx1012bz25048.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="BZ25/iar/iar/startup_pic32cx1012bz25048.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="BZ25/iar/system_pic32cx1012bz25048.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="BZ25/iar/config/linker/Microchip/pic32cx1012bz25048/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="BZ25/iar/config/linker/Microchip/pic32cx1012bz25048/flash.icf" attr="config"/>
         </files>
      </component>
   </components>
</package>
